package Methods;

//Задача 1
//
//Создай класс Person, у которого есть два поля: name и age.
//Добавь метод print(), который выводит их в формате:
//class Person { //первая задача
//    String name;
//    int age;
//
//    void print() {
//        System.out.printf("Name: %s\tAge: %d\n", name, age);
//    }
//}

//class Person { //вторая задача
//    String name;
//    int age;
//
//    void setData(String n, int a) {
//        name = n;
//        age = a;
//    }
//
//    void print() {
//        System.out.printf("Name: %s\tAge: %d\n", name, age);
//    }
//}
//class Person { //третья задача
//    String name;
//    int age;
//
//    void printName() {
//        System.out.println("Name: " + name);
//    }
//
//    void printAge() {
//        System.out.println("Age: " + age);
//    }
//
//    void printInfo() {
//        printName();
//        printAge();
//    }
//}

//class Calculator { //четвертая задача
//
//    int add(int a, int b) {
//        return a + b;
//    }
//
//    int subtract(int a, int b) {
//        return a - b;
//    }
//
//    int multiply(int a, int b) {
//        return a * b;
//    }
//
//    double divide(int a, int b) {
//        if (b == 0) {
//            System.out.println("Ошибка: деление на ноль!");
//            return 0;
//        }
//        return (double) a / b;
//    }
//}
public class Methods {
    public static void main(String[] args) {
//        Person tom = new Person();
//        tom.name = "Tom";
//        tom.age = 41;
//        tom.print();

//        Задача 2
//
//        Добавь в класс Person метод setData(String n, int a),
//        который устанавливает имя и возраст человека.
//        В main вызови этот метод, а затем метод print().


//        Person tom = new Person();
//        tom.setData("Tom", 41);
//        tom.print();

//        Задача 3
//
//        Создай в классе Person три метода:
//
//        printName() — выводит имя,
//
//        printAge() — выводит возраст,
//
//        printInfo() — вызывает оба предыдущих метода.
//
//        В main создай объект, задай значения полей и вызови printInfo().

//        public class Program {
//            public static void main(String[] args) {
//                Person tom = new Person();
//                tom.name = "Tom";
//                tom.age = 41;
//
//                tom.printInfo();

//        Задача 4
//
//        Создай класс Calculator с методами:
//
//        add(int a, int b) — возвращает сумму,
//
//        subtract(int a, int b) — возвращает разность,
//
//        multiply(int a, int b) — возвращает произведение,
//
//        divide(int a, int b) — возвращает результат деления (проверяй, чтобы b не был 0).
//
//                В main вызови все методы и выведи результаты.
//        Calculator calc = new Calculator();
//
//        System.out.println("Сумма: " + calc.add(10, 5));
//        System.out.println("Разность: " + calc.subtract(10, 5));
//        System.out.println("Произведение: " + calc.multiply(10, 5));
//        System.out.println("Деление: " + calc.divide(10, 5));

    }
}

