package TypesOfCollections;

import java.util.ArrayList;
import java.util.HashSet;
import java.util.HashMap;
import java.util.Map;

//public class TypesOfCollections {
//    public static void main(String[] args) {

        // 🧩 Типы коллекций
        // Задача 1:
        // Создай ArrayList из 5 строк и выведи каждую строку в верхнем регистре.

//        ArrayList<String> list = new ArrayList<>();
//        list.add("apple");
//        list.add("banana");
//        list.add("cherry");
//        list.add("date");
//        list.add("elderberry");
//
//        for (String str : list) {
//            System.out.println(str.toUpperCase());
//        }

        // Задача 2:
        // Создай HashSet<Integer> и добавь в него несколько чисел, включая дубликаты.
        // Выведи множество и посчитай, сколько уникальных элементов получилось.

//        HashSet<Integer> set = new HashSet<>();
//        set.add(5);
//        set.add(10);
//        set.add(5);
//        set.add(20);
//        set.add(10);
//        set.add(15);
//
//        System.out.println("Множество: " + set);
//        System.out.println("Количество уникальных элементов: " + set.size());

        // Задача 3:
        // Создай Map<String, Integer>, где ключ — имя человека, значение — его возраст.
        // Выведи имена всех, кому больше 18 лет.

//        Map<String, Integer> ageMap = new HashMap<>();
//        ageMap.put("Анна", 25);
//        ageMap.put("Иван", 17);
//        ageMap.put("Мария", 30);
//        ageMap.put("Петр", 16);
//        ageMap.put("Ольга", 22);
//
//        for (Map.Entry<String, Integer> entry : ageMap.entrySet()) {
//            if (entry.getValue() > 18) {
//                System.out.println(entry.getKey());
//            }
//        }
//    }
//}
