package InterfaceCollection;

import java.util.ArrayList;
import java.util.Collection;
import java.util.Arrays;
import java.util.Iterator;

//public class InterfaceCollection{
//    public static void main(String[] args) {

        // 🧩 Интерфейс Collection
        // Задача 1:
        // Создай объект Collection<String> (например, ArrayList) и добавь туда несколько слов.
        // Проверь с помощью методов isEmpty(), contains(), size().

//        Collection<String> collection1 = new ArrayList<>();
//        collection1.add("apple");
//        collection1.add("banana");
//        collection1.add("cherry");
//
//        System.out.println("Коллекция пуста: " + collection1.isEmpty());
//        System.out.println("Содержит 'banana': " + collection1.contains("banana"));
//        System.out.println("Размер коллекции: " + collection1.size());

        // Задача 2:
        // Создай Collection<Integer> и удали все элементы, меньше 10, используя метод removeIf().

//        Collection<Integer> collection2 = new ArrayList<>(Arrays.asList(5, 15, 8, 20, 3, 25));
//        collection2.removeIf(num -> num < 10);
//        System.out.println("После удаления элементов < 10: " + collection2);

        // Задача 3:
        // Создай две коллекции Collection<String> и найди их пересечение (оставь только элементы, которые есть в обеих).

//        Collection<String> collection3a = new ArrayList<>(Arrays.asList("apple", "banana", "cherry", "date"));
//        Collection<String> collection3b = new ArrayList<>(Arrays.asList("banana", "date", "elderberry", "fig"));
//
//        collection3a.retainAll(collection3b);
//        System.out.println("Пересечение коллекций: " + collection3a);
//    }
//}
