package Arrays;

public class Arrays {

//    Практическая задача 1 — Одномерный массив
//
//    Условие:
//
//    Создай массив из 5 чисел.
//
//    Инициализируй его значениями: 1, 3, 5, 7, 9.
//
//    Выведи на экран третий элемент массива.
//    public static void main(String[] args) {
//        int [] num = {1,3,5,7,9};
//        System.out.println(num[2]);
//    }

//    Практическая задача 2 — Модификация и перебор массива
//
//    Условие:
//
//    Создай массив из 5 чисел: 1, 2, 3, 4, 5.
//
//    Умножь каждый элемент массива на 2.
//
//    Выведи все элементы массива на экран с помощью обычного for или for-each.

//    int [] array = {1,2,3,4,5};
//    for(int i = 0; i < array.length; i++) {
//        array[i] = array[i] *2;
//    }
//    for(int num : array) {
//        System.out.println(num);
//    } //


}
